TexasInstruments/motor-control-sdk/examples/current_sense/icss_sdfm_nine_channel_load_share_snoop_mode/am243x-evm/r5fss0-0_freertos/example.syscfg
section9.$name                       = "Log Shared Memory";
section9.load_memory                 = "LOG_SHM_MEM";
section9.type                        = "NOLOAD";
section9.group                       = false;
section9.output_section.create(1);
section9.output_section[0].$name     = ".bss.log_shared_mem";
section9.output_section[0].alignment = 0;

section10.$name                       = "IPC Shared Memory";
section10.type                        = "NOLOAD";
section10.load_memory                 = "RTOS_NORTOS_IPC_SHM_MEM";
section10.group                       = false;
section10.output_section.create(1);
section10.output_section[0].$name     = ".bss.ipc_vring_mem";
section10.output_section[0].alignment = 0;

section11.$name                       = "Non Cacheable Memory";
section11.load_memory                 = "NON_CACHE_MEM";
section11.group                       = false;
section11.type                        = "NOLOAD";
section11.output_section.create(1);
section11.output_section[0].$name     = ".bss.nocache";
section11.output_section[0].alignment = 0;

section12.$name                       = "Sample Output Memory";
section12.group                       = false;
section12.load_memory                 = "R5F_TCMB0";
section12.output_section.create(1);
section12.output_section[0].$name     = ".gSdfmSampleOutput ";
section12.output_section[0].alignment = 4;

pruicss_g_v0_pwm1.$name                                                 = "CONFIG_PRUICSS_PWM0";
pruicss_g_v0_pwm1.PRUICSS_PWM_IEP.$name                                 = "CONFIG_PRUICSS_PWM_IEP0";
pruicss_g_v0_pwm1.PRUICSS_PWM_CHANNEL[0].$name                          = "CONFIG_PRUICSS_PWM_CHANNEL0";
pruicss_g_v0_pwm1.PRUICSS_PWM_TRIPZONE.create(3);
pruicss_g_v0_pwm1.PRUICSS_PWM_TRIPZONE[0].$name                         = "CONFIG_PRUICSS_PWM_TRIPZONE0";
pruicss_g_v0_pwm1.PRUICSS_PWM_TRIPZONE[0].PRU_ICSSG0_PWM.$assign        = "PRU_ICSSG0_PWM0";
pruicss_g_v0_pwm1.PRUICSS_PWM_TRIPZONE[0].PRU_ICSSG0_PWM.TZ_OUT.$used   = true;
pruicss_g_v0_pwm1.PRUICSS_PWM_TRIPZONE[1].$name                         = "CONFIG_PRUICSS_PWM_TRIPZONE1";
pruicss_g_v0_pwm1.PRUICSS_PWM_TRIPZONE[1].PRU_ICSSG0_PWM.$assign        = "PRU_ICSSG0_PWM1";
pruicss_g_v0_pwm1.PRUICSS_PWM_TRIPZONE[1].PRU_ICSSG0_PWM.TZ_OUT.$assign = "PRG0_PRU1_GPO19";
pruicss_g_v0_pwm1.PRUICSS_PWM_TRIPZONE[1].PRU_ICSSG0_PWM.TZ_OUT.$used   = true;
pruicss_g_v0_pwm1.PRUICSS_PWM_TRIPZONE[2].$name                         = "CONFIG_PRUICSS_PWM_TRIPZONE2";
pruicss_g_v0_pwm1.PRUICSS_PWM_TRIPZONE[2].PRU_ICSSG0_PWM.$assign        = "PRU_ICSSG0_PWM2";
pruicss_g_v0_pwm1.PRUICSS_PWM_TRIPZONE[2].PRU_ICSSG0_PWM.TZ_OUT.$assign = "PRG0_PRU1_GPO8";
pruicss_g_v0_pwm1.PRUICSS_PWM_TRIPZONE[2].PRU_ICSSG0_PWM.TZ_OUT.$used   = true;

pruicss1.$name                                                                      = "CONFIG_PRU_ICSS0";
pruicss1.coreClk                                                                    = 300000000;
pruicss1.iepClk                                                                     = 300000000;
pruicss_g_v0_pwm1.PRUICSS                                                           = pruicss1;
sdfm1.pru                                                                           = pruicss1;
pruicss1.AdditionalICSSSettings[0].$name                                            = "CONFIG_PRU_ICSS_IO0";
pruicss1.AdditionalICSSSettings[0].PruEcapIO.create(1);
pruicss1.AdditionalICSSSettings[0].PruEcapIO[0].$name                               = "CONFIG_PRU_ICSS_ECAP_IO0";
pruicss1.AdditionalICSSSettings[0].PruEcapIO[0].PRU_ICSSG0_ECAP.$assign             = "PRU_ICSSG0_ECAP0";
pruicss1.AdditionalICSSSettings[0].PruEcapIO[0].PRU_ICSSG0_ECAP.IN_APWM_OUT.$assign = "PRG0_PRU1_GPO15";
pruicss1.AdditionalICSSSettings[0].PruEcapIO[0].PRU_ICSSG0_ECAP.IN_APWM_OUT.$used   = true;
pruicss1.intcMapping.create(3);
pruicss1.intcMapping[0].$name                                                       = "CONFIG_ICSS0_INTC_MAPPING0";
pruicss1.intcMapping[0].event                                                       = "21";
pruicss1.intcMapping[0].host                                                        = "3";
pruicss1.intcMapping[0].channel                                                     = "3";
pruicss1.intcMapping[1].$name                                                       = "CONFIG_ICSS0_INTC_MAPPING1";
pruicss1.intcMapping[1].event                                                       = "24";
pruicss1.intcMapping[1].channel                                                     = "6";
pruicss1.intcMapping[2].$name                                                       = "CONFIG_ICSS0_INTC_MAPPING2";
pruicss1.intcMapping[2].event                                                       = "27";
pruicss1.intcMapping[2].host                                                        = "9";
pruicss1.intcMapping[2].channel                                                     = "9";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
sdfm1.PRU_ICSSG0_PRU.GPI16.$suggestSolution                                      = "PRG0_PRU0_GPO16";
sdfm1.PRU_ICSSG0_PRU.GPI1.$suggestSolution                                       = "PRG0_PRU0_GPO1";
sdfm1.PRU_ICSSG0_PRU.GPI3.$suggestSolution                                       = "PRG0_PRU0_GPO3";
sdfm1.PRU_ICSSG0_PRU.GPI5.$suggestSolution                                       = "PRG0_PRU0_GPO5";
sdfm1.PRU_ICSSG0_PRU.GPI7.$suggestSolution                                       = "PRG0_PRU0_GPO7";
sdfm1.PRU_ICSSG0_PRU.GPI18.$suggestSolution                                      = "PRG0_PRU0_GPO18";
sdfm1.PRU_ICSSG0_PRU.GPI11.$suggestSolution                                      = "PRG0_PRU0_GPO11";
sdfm1.PRU_ICSSG0_PRU.GPI13.$suggestSolution                                      = "PRG0_PRU0_GPO13";
sdfm1.PRU_ICSSG0_PRU.GPI15.$suggestSolution                                      = "PRG0_PRU0_GPO15";
sdfm1.PRU_ICSSG0_PRU.GPI17.$suggestSolution                                      = "PRG0_PRU0_GPO17";
gpio2.MCU_GPIO.$suggestSolution                                                  = "MCU_GPIO0";
gpio3.MCU_GPIO.$suggestSolution                                                  = "MCU_GPIO0";
debug_log.uartLog.UART.RXD.$suggestSolution                                      = "UART0_RXD";
debug_log.uartLog.UART.TXD.$suggestSolution                                      = "UART0_TXD";
pruicss_g_v0_pwm1.PRUICSS_PWM_CHANNEL[0].PRU_ICSSG0_PWM.$suggestSolution         = "PRU_ICSSG0_PWM0";
pruicss_g_v0_pwm1.PRUICSS_PWM_CHANNEL[0].PRU_ICSSG0_PWM.pwmPin.$suggestSolution  = "PRG0_PRU0_GPO12";
pruicss_g_v0_pwm1.PRUICSS_PWM_TRIPZONE[0].PRU_ICSSG0_PWM.TZ_OUT.$suggestSolution = "PRG0_PRU0_GPO19";
